Repository: krzysztofrutana/azure_devops_testcase_associate_rider_plugin
Catalog: src/dotnet/ReSharperPlugin.DevOpsTCPlugin/Resources.*.resx
Languages: pl

# Title
source: Assign a test to Azure Test Case
pl: Przypisz test do Azure Test Case

# Description
source: The action allows you to assign test information to the Associated Automation tab in Azure Test Case
pl: Akcja pozwala przypisać informacje o teście do zakładki Associated Automation w Azure Test Case

# NoPATMessage
source: No token. Add the AZURE_DEVOPS_PAT environment variable with the token.
pl: Brak tokenu. Dodaj zmienną środowiskową AZURE_DEVOPS_PAT z tokenem.

# IncorrectTest
source: Incorrect test indicated
pl: Wskazano nieprawidłowy test

source: Organization
pl: Organizacja

# ProjectInOrganization
source: Project in the organization
pl: Projekt w organizacji

source: Test Case Azure ID
pl: Test Case ID w Azure

# TestAlreadyAssigned
source: Test Case already has the specified test assigned. I'm skipping it.
pl: Test Case ma już przypisany wskazany test. Pomijam

# TestCaseUpdated
source: Test Case has been updated
pl: Test Case został zaktualizowany

# Error
source: An error occurred
pl: Wystąpił błąd

# OrganizationCannotBeEmpty
source: Organization cannot be empty. Enter it manually or add it as an AZURE_DEVOPS_ORGANIZATION environment variable.
pl: Organizacja nie może być pusta. Wprowadź ją ręcznie lub dodaj jako zmienna środowiskowa AZURE_DEVOPS_ORGANIZATION.

# OrganizationProjectCannotBeEmpty
source: The organization project cannot be empty. Enter it manually or add it as an AZURE_DEVOPS_ORGANIZATION_PROJECT environment variable.
pl: Projekt organizacji nie może być pusty. Wprowadź go ręcznie lub dodaj jako zmienną środowiskową AZURE_DEVOPS_ORGANIZATION_PROJECT.

# TestCaseIdCannotBeEmpty
source: You must provide a Test Case ID to assign a test to a TestCase.
pl: Należy podać ID Test Case w celu przypisania testu do TestCase.

# TestPathCannotBeEmpty
source: The test path cannot be empty.
pl: Ścieżka do testu nie może być pusta.

# ProjectDllCannotBeEmpty
source: The DLL name of the project containing the test cannot be empty.
pl: Nazwa DLL projektu zawierającego test nie może być pusta.

# AlreadyAssignedTC
source: Already assigned test cases
pl: Przypisane test cases

# AssingButton
source: Assing
pl: Przypisz

source: Close
pl: Zamknij

# WorkitemNotFound
source: No Test Case with the specified ID was found.
pl: Nie znaleziono Test Case o podanym ID.

# AssignmentDialogTitle
source: Assignment
pl: Przypisywanie

# ConfirmAssignmentForTestCase
source: Are you sure you want to assign the indicated test to the Test Case:
pl: Czy na pewno przypisać wskazany test do Test Case:

# OrganizationSettingsLabel
source: Organization settings
pl: Ustawienia organizacji

source: Save settings for project
pl: Zapisz ustawienia dla projektu

# SettingsSaved
source: Settings saved for project
pl: Ustawienia zapisane pomyślnie dla projektu

# ShouldSelectCurrentTest
source: Please select the specific test to be assigned
pl: Należy zaznaczyć konkretny test do przypisania

# ManageTokensTitle
source: Manage tokens
pl: Zarządzanie tokenami

source: Solution
pl: Solucja

source: Add
pl: Dodaj

source: Save
pl: Zapisz

source: Token is required
pl: Token jest wymagany

# AllDataForTokenIsRequired
source: All data for the token must be completed
pl: Należy uzupełnić wszystkie dane dla tokenu

# TestCaseTitleLabel
source: Title
pl: Tytuł

source: Delete
pl: Usuń

# DeleteTokenConfirmationMessage
source: Are you sure you want to delete the token:
pl: Czy jesteś pewny że chcesz usunąć token:

source: No token selected.
pl: Nie znaznaczono tokenu.

source: Edit
pl: Edytuj

# SupportMyWork
source: Do you like my work? Buy me a coffee :)
pl: Podoba Ci się moja praca? Kup mi kawę :)

# LinkCopied
source: Link copied to clipboard
pl: Link skopiowany do schowka

source: Check token data
pl: Sprawdź dane tokenu
